{
    "_id": "a6bdc96c93e27437264ffcbc431ce8fac9be21e8c7da1cc41518c2a962efd92e",
    "index": 1,
    "blockTimestamp": "2023-04-05 19:10:34.453220",
    "proof": 1,
    "previous_hash": "0",
    "article_title": "I'm the genesis block",
    "article_date": 0,
    "article_author": "null",
    "article_link": "null",
    "article_body": "null"
}
{
    "_id": "b7d6675d5caea9beb9fef54d006b1de46e3ed4bc8bd51250f9bdb585bd2052b0",
    "index": 2,
    "blockTimestamp": "2023-04-05 19:10:34.793339",
    "proof": 58503,
    "previous_hash": "5267555fdc2f67692498da79394870bce5809630f91782f0d935ffa994b4b904",
    "article_title": "Narrow abortion exemption bill passed by Tennessee lawmakers",
    "article_date": "April 5, 2023 GMT",
    "article_author": "By KIMBERLEE KRUESI",
    "article_link": "https://apnews.com/article/abortion-ban-exemption-tennessee-7a69fa5b654ffeb16799571bab89fbd8",
    "article_body": "NASHVILLE, Tenn. (AP) -- Tennessee's GOP-dominant Senate gave final approval Wednesday to legislation that would add a narrow exemption to one of the strictest abortion bans in the United States, with it now heading to Gov. Bill Lee's desk for his approval.The Senate passed the bill on a 26-1 vote, with several of the chamber's Democratic lawmakers voting \"present\" rather than picking a side.The bill's passage comes after weeks of drastically reworking the proposal in order to gain enough support from the General Assembly's Republican supermajority, as well as the state's powerful anti-abortion lobby, which had warned lawmakers would likely face political retribution if they advanced a bill without the group's endorsement.Under the bill, doctors would be allowed to use \"reasonable medical judgment\" when determining an abortion is necessary to prevent the death of a pregnant patient or to spare her from the irreversible, severe impairment of a major bodily function. Some doctors argue that is a harsher legal standard than before.Currently, Tennessee has no explicit exemptions under it's so-called \"trigger law,\" which wasn't allowed to go into effect until after the U.S. Supreme Court overturned the constitutional right to abortion. Instead the law includes an \"affirmative defense\" for doctors, meaning the burden is on the physician to prove that an abortion was medically necessary -- instead of requiring the state to prove the opposite.The bill headed to Gov. Lee's desk removes the affirmative defense for doctors and adds in language that doctors may provide abortion services for ectopic pregnancies and miscarriages. However, it does not keep the previous version's inclusion of \"medically futile pregnancies\" and lethal fetal anomalies as approved reasons for physicians to provide an abortion. Instead, it allows doctors to use \"reasonable medical judgment\" to determine if an abortion is necessary.Lee, a Republican, has not publicly commented on whether he supports the legislation. He has previously defended the state's current law and has said it does not need to be changed."
}
{
    "_id": "ea3099690e17ff059bd332f8caad21d4f55051e1cf7f80ffe0dbf4b9a9e67e21",
    "index": 3,
    "blockTimestamp": "2023-04-05 19:10:46.142196",
    "proof": 39584,
    "previous_hash": "41834587e9272b67f14ea09359852ea0d62e6c7016ce9fe5641bfe8a3da5b4c8",
    "article_title": "DOJ tentatively settles over Texas church shooting for 144M",
    "article_date": "April 5, 2023 GMT",
    "article_author": "By PAUL J. WEBER",
    "article_link": "https://apnews.com/article/texas-mass-shooting-guns-settlement-church-justice-5df2087bee86fddfc5b20bcbdb877f2b",
    "article_body": "AUSTIN, Texas (AP) -- The Justice Department announced Wednesday a tentative 144 million settlement with families and victims of a 2017 mass shooting at a Texas church that was carried out by a former U.S. airman who was able to purchase firearms despite a criminal history.More than two dozen people were killed when Devin Patrick Kelley opened fire during a Sunday service at First Baptist Church of Sutherland Springs. Authorities put the official death toll at 26 because one of the 25 people killed was pregnant in what remains the deadliest mass shooting in Texas history. Kelley had served nearly five years in the Air Force before being discharged in 2014 for bad conduct, after he was convicted of assaulting a former wife and stepson, cracking the child's skull. The Air Force has publicly acknowledged that the felony conviction for domestic violence -- had it been put into the FBI database -- could have prevented Kelley from buying guns from licensed firearms dealer.U.S. District Judge Xavier Rodriguez had previously ruled that the Air Force was \"60 liable\" for the attack because it failed to submit Kelley's assault conviction during his time in the Air Force to a national database. He ruled that Kelley was at fault for the rest. The Justice Department said the settlement is still subject to court approvals. \"No words or amount of money can diminish the immense tragedy of the mass shooting in Sutherland Springs,\" said Vanita Gupta, associate attorney general for the Justice Department, in a statement. \"Today's announcement brings the litigation to a close, ending a painful chapter for the victims of this unthinkable crime.\"A lawyer representing the Sutherland Springs victims did not immediately return messages seeking comment. Federal court records filed Wednesday in Texas show that attorneys for the victims told the judge they had reached a settlement. The settlement would end a long-running lawsuit that was filed in 2018. When lawsuits are filed against federal agencies or programs, they are defended by attorneys with the Justice Department, which has separate divisions for criminal prosecutions and other responsibilities.The settlement is less than the 230 million that Rodriguez had ordered the government to pay families and the victims last year, but the Justice Department appealed that ruling. Rodriguez said in 2021 that had the government done its job and entered Kelley's history into the database, \"it is more likely than not that Kelley would have been deterred from carrying out the Church shooting.\" Kelley was able to purchase four firearms after being discharged in 2014, three of which he carried into the church. After the shooting, the Air Force was blamed for not reporting his record to the FBI. The conviction would have been a red flag in the mandatory background check when Kelley tried to purchase a gun.Kelley died of an apparent self-inflicted gunshot wound after he was shot and chased by two men who heard the gunfire at the church."
}
{
    "_id": "24f761e48f00880d39cd07e2c38e92dc4860056b71ad2d53321cc31681208e31",
    "index": 4,
    "blockTimestamp": "2023-04-05 19:10:59.325332",
    "proof": 10380,
    "previous_hash": "162caa84325b810fa930fadcca6fe32136b2374a318b139c98e5d9af0cdc878c",
    "article_title": "Predawn Missouri tornado kills at least 5, sows destruction",
    "article_date": "April 5, 2023 GMT",
    "article_author": "By JIM SALTER and SCOTT McFETRIDGE",
    "article_link": "https://apnews.com/article/midwest-south-storms-tornadoes-2783b74e077740b3c253ce30632ff04d",
    "article_body": "ST. LOUIS (AP) -- A large tornado tore through southeastern Missouri before dawn on Wednesday, killing at least five people and causing widespread destruction as a broad swath of the Midwest and South kept a wary eye out for further storms that could spawn additional twisters and hail.The tornado touched down around 3:30 a.m. and moved through a rural area of Bollinger County, about 50 miles (80 kilometers) south of St. Louis, said Sgt. Clark Parrott of the Missouri State Highway Patrol. Trees were uprooted and homes turned into piles of splinters. One building was flipped on its side. Drone footage showed emergency crews peering into the wreckage with flashlights. More than 20 agencies were part of the search for survivors and victims, with the damage so bad that they sometimes were forced to use chainsaws to cut back trees and brush to reach homes, Parrott said.\"The damage is pretty widespread. It's just heartbreaking to see it,\" Parrott said.The twister caused significant destruction in and around the small rural communities of Glen Allen and Grassy, Bollinger County Sheriff Casey A. Graham said in a Facebook post. A hunting area separates the two communities. At least five people were killed, Graham wrote, noting that he was withholding the names of the dead to make sure their families could be notified first.\"Please understand the scope of this operation,\" he said. \"I know everyone wants updates and news of what happened. As your Sheriff, I am focused on ensuring those who still need help are receiving it, and we account for all our citizens.\"Charles Collier, 61, said he saw the coroner's van drive by with its lights on in Glen Allen, where he owns a storage facility.\"That was a sad, sad sight -- knowing there was bodies in there,\" said Collier, who wasn't entirely relieved when he saw his facility was spared. \"I was just numb, thinking about all these other people, what they're going through.\"Josh Wells said that the tornado hit his house in Glen Allen, tearing half of his roof off and pushing his bedroom wall in. He added in a text that a propane storage unit in the area got damaged, and gas leaked for about an hour, \"making the whole area smell of propane.\"Justin Gibbs, a National Weather Service meteorologist in Paducah, Kentucky, said the tornado remained on the ground for roughly 15 minutes, traveling an estimated 15-20 miles (24-32 kilometers).A weather service team was headed to Bollinger County to gather details about the tornado, but Gibbs said it's clear \"it was big. It was a significant tornado.\"He noted that tornadoes are especially dangerous when they touch down late at night or early in the morning, as this one did.\"It's definitely a nightmare from a warning standpoint,\" Gibbs said. \"It's bad anytime, but it's especially bad at 3:30 in the morning.\"Larry Welker, Bollinger County's public administrator, said the twister traveled along route 34 into Glen Allen, a village of slightly more than 100 people, and that he hasn't been able to inspect the damage firsthand because law enforcement were restricting access to the area.\"I'm getting reports that it was pretty bad,\" he said. He described it as a rural area, where residents mostly farmed, cut timber or worked construction jobs.\"There was several trailers there, and I understand that there is still people missing,\" Welker said.Gov. Mike Parson said he would join emergency personnel on the ground to assess damage and determine what resources are needed. They planned a news conference in the afternoon. The storms moving through the Midwest and South on Wednesday threaten some areas still reeling from a deadly bout of bad weather last weekend. The Storm Prediction Center said up to 40 million people in an area that includes major cities including Chicago, Indianapolis, Detroit and Memphis, Tennessee, were at risk from the storms later Wednesday. As of late morning, the the greatest threat appeared to be to an area stretching from lower Michigan into Tennessee and Kentucky.Fierce storms that started last Friday and continued through the weekend spawned deadly tornadoes in 11 states as the system plodded through Arkansas and into the South, Midwest and Northeast.Schools in Little Rock, Arkansas, canceled Wednesday classes because the storms were expected to move through the area during the morning rush, KFVS-TV reported.In central Illinois, authorities said five people were hurt and about 300 homes were without power due to a tornado that struck in Fulton County on Tuesday evening. Chris Helle, who directs the county's Emergency Services Disaster Agency, said one of the people injured was in critical condition.Helle said the damage was concentrated near the town of Bryant, about 200 mile (322 kilometers) southwest of Chicago. Fire departments and other first responders were still cataloguing the damage there, but Helle said numerous homes had been destroyed. He credited people for listening to advance warnings and taking shelter.Officials said another tornado touched down Tuesday morning in the western Illinois community of Colona. Local news reports showed wind damage to some businesses there.Winds of up to 90 mph (145 kph) and baseball-sized hail also caused damage in the Quad Cities area of Iowa and Illinois.The National Weather Service also received reports of semitrailers that had been tipped over by winds in Lee County, about 95 miles (153 km) west of Chicago.___McFetridge reported from Des Moines, Iowa. Associated Press writers Margaret Stafford in Liberty, Missouri, Heather Hollingsworth in Mission, Kansas, and Trisha Ahmed in Minneapolis contributed to this report."
}
{
    "_id": "1dd648a88308df7f44e105de1ef8e3659b8267bf957a39e7201ec34f7a962031",
    "index": 5,
    "blockTimestamp": "2023-04-05 19:11:11.411929",
    "proof": 61911,
    "previous_hash": "c28fee1dc7b5c16f384fc421a4979dc52aaa1d54c16ee39fd5d94bbd29e8cda4",
    "article_title": "Trump's bravado tested as legal woes overlap with campaign",
    "article_date": "April 5, 2023 GMT",
    "article_author": "By JILL COLVIN",
    "article_link": "https://apnews.com/article/trump-indictment-angry-fundraising-maga-not-guilty-0bfe597c1d19e0f9d6e8c8bccb430176",
    "article_body": "NEW YORK (AP) -- When Donald Trump stepped into a Manhattan courthouse Tuesday afternoon, his usual bravado was replaced with palpable anger and notable silence as the former president was reduced to a criminal defendant in custody. By the time he returned to his Mar-a-Lago club hours later, he was ready to unleash.\"The only crime that I have committed is to fearlessly defend our nation from those who seek to destroy it,\" the first former president to be indicted told a crowd of hundreds of loyal supporters.Trump made an unlikely transformation from reality television star to U.S. president by tapping into the grievance of Republican voters disillusioned with the political establishment. As he wages a comeback bid for the White House, Trump and his campaign hope that his indictment will serve as a rallying cry that will galvanize the same voters. Already, he has raised millions of dollars off the news.It's an approach that will test Trump's \"all publicity is good publicity\" adage as his decades-long history of bending the world to his will collides with cold legal reality. Trump, the early frontrunner for the Republican presidential nomination, now faces the unprecedented prospect of mounting another campaign for the White House while simultaneously being on trial for charges stemming from hush money payments to women during his 2016 campaign. He remains under investigation in Georgia and Washington, raising the prospect of multiple trials in several jurisdictions, all unfolding as Republicans begin voting on their next nominee.In the meantime, Trump's rivals for the Republican presidential nomination are struggling to emerge from his ever-growing shadow, even as the proceedings raise serious questions about Trump's viability in a general election.\"A lot of times you have a candidate who's in trouble, you create a diversion,\" said Trump campaign pollster John McLaughlin. \"They're indicting Trump, Trump consumes all the headlines and media coverage.\"While most defendants would see an arrest as an indignity to be handled quietly, Trump -- a man who has always craved the media spotlight -- seized the PR and fundraising opportunity, blasting out his itinerary and narrating a play-by-play on social media.\"Heading to Lower Manhattan, the Courthouse. Seems so SURREAL -- WOW, they are going to ARREST ME. Can't believe this is happening in America. MAGA!\" he wrote on Truth Social as his motorcade headed toward the courthouse, his every movement captured by news helicopters hovering overhead.His campaign further hyped the appearance in fundraising solicitations. \"My last email before my arrest,\" one read.As he was behind closed doors at the courthouse being booked and fingerprinted, his campaign began advertising a \"NEW ITEM\" to donors: A t-shirt featuring a doctored black-and-white \"mug shot\" of Trump, complete with an exaggerated height chart and the words, \"NOT GUILTY.\"In reality, Trump was not subjected to a mug shot Tuesday -- one of several exceptions from normal operating procedure made for the former president -- underscoring the contrast between the image he hoped to project and his actual appearance as faced 34 felony counts of falsifying business records in the first degree.After being caught off guard by the charges, Trump appeared unmistakably livid as he left Trump Tower Tuesday afternoon and arrived at the lower Manhattan courthouse. He was stone-faced and silent as he entered the courtroom alone, pushing the door open himself.\"What do you expect his reaction was?\" Trump's lawyer Todd Blanche said outside the courthouse immediately following the appearance. \"He's frustrated, he's upset. But I'll tell you what: He's motivated. And it's not going to stop him. It's not going to slow him down.\"During the hearing, Trump was subdued. He spent the proceeding mostly listening and spoke just 10 words in total, including \"Not guilty,\" \"Yes,\" \"Thank you,\" and \"I do.\" At one point, after a discussion about whether one of his lawyers might have a conflict of interest, Trump was told by the judge he had the right to conflict-free representation and was asked if he understood. Trump's response was so faint that the judge gestured to his hear, signaling he hadn't heard the answer. \"Yes,\" Trump then offered.Before the proceeding, Trump declined to speak to assembled reporters, as had been expected.\"He is angry,\" Barbara Res, a longtime former employee who was a vice president at the Trump Organization, said of the former president after watching the proceedings. \"He has a look on his face and I've seen that look. That look is, 'I'm going to kill you.'\"Trump, according to people who had spoken to him in recent days, had seemed both resigned and angry as he processed the reality of the pending charges, which remained under seal until the hearing. On Tuesday at the courthouse, he was described as resolute and calm -- mad about the circumstances, but also pleased by his respectful treatment by court officers, U.S. Secret Service and staff from the District Attorney's office.\"He is angry. He is frustrated, but he is dedicated to defeating this,\" said U.S. Rep. Marjorie Taylor Greene, a Georgia Republican who appeared at a pro-Trump rally in New York across the street from the courthouse and joined the former president at Mar-a-Lago Tuesday night.Trump, after the hearing, flew straight back home to Florida, where he delivered a grievance-filled primetime speech, again criticizing the prosecution and judge presiding over the case despite being admonished hours earlier about incendiary rhetoric.Aides had assembled a crowd of hundreds of his most loyal supporters, including failed Arizona gubernatorial candidate Kari Lake and \"MyPillow\" founder and election conspiracist Mike Lindell. The scene, in some ways, felt more like a campaign launch than the subdued announcement he held in the same room in November, with an amped-up crowd cheering him on. After his speech, he joined supporters at a reception on the Mar-a-Lago patio, where he mingled late into the night.Indeed, Trump went so far as to insist the day had been a \"great\" one during an \"emergency\" prayer call after he left the courthouse.\"We're winning. We had a great day today, actually, because it turned out to be a sham,\" he said, according to audio posted online.Trump is due back in court in December for a hearing, though lawyers have asked that he be excused from attending because of the extraordinary security involved. Prosecutors asked the judge to set a trial for January -- just weeks before the first votes will be cast in the 2024 Republican presidential primary. Trump's lawyers said they felt a more realistic start date would be the spring -- a time when Trump could theoretically have locked down the Republican nomination, or be in the midst of a bitter primary fight.It remains unclear how the charges will reverberate long term, especially if Trump faces additional indictments in Georgia and Washington, where prosecutors are investigating his efforts to overturn the results of the 2020 election and his handling of classified documents. Trump has already alienated many swing voters, particularly suburban women, who abandoned him 2020.A CNN poll conducted after news of the indictment became public, but before it was unsealed, found that, while 60 of U.S. adults approve of the decision to bring charges, a majority of Americans -- about three quarters -- believe the indictment was motivated, at least, in, part by politics.\"In the short term, I think without a doubt that it will rally more right-of-center voters around President Trump,\" said former Wisconsin Gov. Scott Walker, who competed against Trump in the 2016 GOP primary. \"Who would ever have thought that an indictment would be anything but a negative?\"McLaughlin, the Trump pollster, said he has found Republican primary voters, already angry, are rallying around the former president.\"It's making angry people even angrier,\" he said. \"They've got a candidate who is now the frontrunner for president.. and he's being indicted for something they don't understand.\"__Associated Press writers Colleen Long in Washington, Michael R. Sisak and Jennifer Peltz in New York and Adriana Gomez Licon in Palm Beach, Florida contributed to this report."
}
{
    "_id": "8729e2892cd460e073b4e28fc98cb8093f500a7f4a78484a0517bc33a4ab609b",
    "index": 6,
    "blockTimestamp": "2023-04-05 19:11:27.525252",
    "proof": 10444,
    "previous_hash": "e52459aed2bdcc95b47366163a1d1712c53492a990130dd8ff157eac1deaf4ea",
    "article_title": "Chicago firefighter dies after battling high-rise blaze",
    "article_date": "April 5, 2023 GMT",
    "article_author": "no author",
    "article_link": "https://apnews.com/article/high-rise-fire-chicago-c54dd33e02792f297ea967d1dca0551b",
    "article_body": "CHICAGO (AP) -- A firefighter died Wednesday after being critically injured while battling a blaze in a high-rise building on Chicago's North Side, authorities said.Lt. Jan Tchoryk, 55, \"went down\" on the stairs on the building's 11th floor, Fire Commissioner Annette Nance-Holt told reporters.The blaze was reported before 8 a.m. on the 27th floor of the condo and apartment building in the Gold Coast neighborhood. A medical examiner will determine Tchoryk's cause of death.Tchoryk is the second Chicago firefighter to die this week. Jermaine Pelt, 49, died on Tuesday and two other firefighters were injured while battling a house fire on the city's South Side.\"Our men and women who are first responders in the city are heroic,\" outgoing Mayor Lori Lightfoot said Wednesday afternoon at a news conference. \"They are brave. They, every single day, put their lives on the line for us. They deserve our unending thanks and support, not just on a tragic day like this, but every single day.\"Three other firefighters were hurt in Wednesday's blaze and taken to hospitals where their conditions were listed as fair to serious, officials said.Two civilians also were taken to hospitals in good condition. Fire officials did not immediately say if they are residents of the building. Fire Department Director Larry Langford said the person who lives in the burning apartment made it out safely.Langford said it was unclear how the fire started.Fire department video showed flames and smoke pouring from a terrace or balcony early Wednesday. By mid-morning, most of the blaze was extinguished, but crews were still addressing hot spots and smoke."
}
{
    "_id": "b744cfd53d08b3d0a24b0d509f903fcf37c8d832a828eb7e51141fa452deb3d3",
    "index": 7,
    "blockTimestamp": "2023-04-05 19:11:40.923292",
    "proof": 32162,
    "previous_hash": "0c13a0f974a11c9410e038ca1a99cde38969a9c80b10b2760c493493bfab4082",
    "article_title": "Report: Ex-Scottish leader's husband arrested in party probe",
    "article_date": "April 5, 2023 GMT",
    "article_author": "By DANICA KIRKA and BRIAN MELLEY",
    "article_link": "https://apnews.com/article/scotland-nicola-sturgeon-husband-arrested-0e620a7d44dd9d0999f28702074c7042",
    "article_body": "LONDON (AP) -- The husband of former Scottish first minister and Scottish National Party leader Nicola Sturgeon has been arrested in a party finance probe, British media reported Wednesday.Police in Scotland did not identify Peter Murrell as the 58-year old man arrested Wednesday \"in connection with the ongoing investigation into the funding and finances of the Scottish National Party.\" However, Britain's Press Association, the BBC and others reported it was Murrell.Scottish police have been investigating how 600,000 pounds (750,000) earmarked for the Scottish independence campaign was spent.\"Clearly it would not be appropriate to comment on any live police investigation but the SNP have been cooperating fully with this investigation and will continue to do so,\" the party said in a statement released after the arrest.Murrell, 58, resigned March 18 as the party's chief executive amid a controversy about the party's declining membership and the contest to replace Sturgeon. He held the position for more than 20 years.Sturgeon, 52, abruptly announced her resignation in February after eight years as party leader and first minister of Scotland's semi-autonomous government. Sturgeon said at that time that serving well was knowing when to make way for someone else. \"In my head and in my heart I know that time is now,\" she said. \"That it's right for me, for my party and my country.\"Deputy Scottish Labour leader Jackie Baillie said the arrest was \"deeply concerning\" and called on Sturgeon and her successor, Humza Yousaf, to \"urgently state what they knew and when.\"Yousaf said he had not had a role in party finances and vowed to be transparent under his leadership.The investigation could further harm the SNP's political fortunes, which saw its poll numbers droop during the acrimonious election to replace Sturgeon. \"It certainly doesn't do us any good,\" Yousaf said when asked if Murrell's arrest would hurt the party. \"People will have questions, there will be some concerns. Our party membership will have concerns too.\"John Curtice, a politics professor at the University of Strathclyde, said the impact of the arrest on the party and Sturgeon's legacy would depend on whether prosecutors file a case. But it's already dealt a setback to her successor, who just took office last week.\"As of today, there's no Yousaf bounce. It's the opposite -- it's gone down,\" Curtice said. \"This doesn't make it easier for him to start off on the front foot, and he probably needs to start off on the front foot.\"Her husband's arrest \"undoubtedly refueled speculation\" on the reason Sturgeon unexpectedly resigned, but it's not known what she was aware of when she stepped down, Curtice said. Yousaf said he did not believe the investigation into party finances had caused Sturgeon to resign. \"I believe her very much when she says how exhausted she was,\" Yousaf said. \"I think anybody who watched her over the course of the pandemic during those daily briefings, day after day, I think anybody could understand how exhausting that is.\"Sturgeon had led Scotland since 2014, when Scots voted to remain part of the United Kingdom. While the referendum was billed as a once-in-a-generation decision on independence, Sturgeon and her party had pushed for a new vote, arguing that Britain's departure from the European Union had changed the ground rules.The Scottish government wants to hold a referendum next October with the question \"Should Scotland be an independent country?\"The U.K. government in London refuses to approve a vote, saying the question was settled in a 2014 referendum that saw Scottish voters reject independence by a margin of 55 to 45.Murrell's resignation came just before his wife left office and as three members of Scottish Parliament fought a bitter contest to replace her.The SNP had publicly denied a newspaper report that its membership had plunged from more than 100,000 to just over 70,000 in the past year, before admitting it was true. Murrell accepted responsibility and quit, saying that \"while there was no intent to mislead, I accept that this has been the outcome.\"Police cars were parked outside the couple's Glasgow home Wednesday and a blue tent had been erected by officers in front of the house.Officers were also stationed outside the SNP headquarters in Edinburgh and several police vans were parked near the building. The presence of police at both locations created a bad image for the party, as well as Sturgeon and her husband, Curtice said.\"Perhaps the money given to the party for one purpose was used for another,\" he said. \"It's probably not the world's biggest crime but it's not a good look, if it gets pursued further.\""
}
