{
    "_id": "a6bdc96c93e27437264ffcbc431ce8fac9be21e8c7da1cc41518c2a962efd92e",
    "index": 1,
    "blockTimestamp": "2023-04-06 18:42:27.521885",
    "proof": 1,
    "previous_hash": "0",
    "article_title": "I'm the genesis block",
    "article_date": 0,
    "article_author": "null",
    "article_link": "null",
    "article_body": "null"
}
{
    "_id": "c5be90eb86ff586385df81746e6ef1b370d7762a5ed9f8fe5b353f133f94a87a",
    "index": 2,
    "blockTimestamp": "2023-04-06 18:42:27.855390",
    "proof": 147065,
    "previous_hash": "a3cd248d79082341214f222cdcb7b3fddd77f5c7ff3791ac853e8bb8b266d27a",
    "article_title": "US review of chaotic Afghanistan withdrawal says Biden 'severely constrained by conditions' left by predecessor Trump",
    "article_date": "April 6, 2023 GMT",
    "article_author": "no author",
    "article_link": "https://apnews.com/article/politics-donald-trump-ap-news-alert-053499cc5512d2a1d1dbffab67f01943",
    "article_body": "WASHINGTON (AP) -- US review of chaotic Afghanistan withdrawal says Biden 'severely constrained by conditions' left by predecessor Trump."
}
{
    "_id": "15f8448ffd69e5c09eb8d13077f2d3e374eeabda396712bfc1627c4ad4e68831",
    "index": 3,
    "blockTimestamp": "2023-04-06 18:42:29.975010",
    "proof": 11296,
    "previous_hash": "895fcb1e0d4b17bdc502c58b13d8ef4ca2fec4ba856d422da8672d7d39cc0434",
    "article_title": "US ambassador and Russian diplomat discuss arrested reporter",
    "article_date": "April 6, 2023 GMT",
    "article_author": "The Associated Press",
    "article_link": "https://apnews.com/article/russia-journalist-arrested-journal-gershkovich-05314d872456b3e5a65f756a84939070",
    "article_body": "The U.S ambassador to Russia and a top Russian diplomat met Thursday to discuss a Wall Street Journal reporter who was arrested last week on espionage charges, the Russian Foreign Ministry said.In the meeting with U.S. Ambassador Lynne T. Tracy, Russian Deputy Foreign Minister Sergei Ryabkov stressed \"the serious nature of the charges\" against American journalist Evan Gershkovich, according to a ministry statement.\"It was emphasized that he was caught red-handed while trying to obtain secret information, using his journalistic status as a cover for illegal actions,\" the statement said. The ministry added that \"the hype in the United States around this case, which is aimed at putting pressure on the Russian authorities and the court, which should decide the fate of Gershkovich, is hopeless and senseless.\" Gershkovich, 31, was arrested in Yekaterinburg, Russia's fourth-largest city, on March 29. He is the first U.S. correspondent since the Cold War to be detained for alleged spying. Russia's Federal Security Service accused Gershkovich of trying to obtain classified information about a Russian arms factory. The Journal has denied the accusations.Lawyers representing Gershkovich met with him Tuesday for the first time since his detention, according to The Wall Street Journal. Editor-in-Chief Emma Tucker said the paper was encouraged by the visit and Gershkowich's family is \"relieved to know we finally have contact with Evan.\" \"Evan's health is good, and he is grateful for the outpouring of support from around the world. We continue to call for his immediate release,\" Tucker said in a note to the newsroom Tuesday. Gershkovich was ordered held behind bars for two months in Russia pending an investigation. A Moscow court said Monday that it had received a defense appeal of his arrest; the appeal is to be heard on April 18, Russian news agencies reported. U.S. Secretary of State Antony Blinken urged Russian Foreign Minister Sergey Lavrov on Sunday -- during a rare phone call between the diplomats since the start of the Ukraine war -- to release Gershkovich immediately, as well as another imprisoned American, Paul Whelan."
}
{
    "_id": "22e39ca4ce9b2deca4d8d555af2930d4a35043cdef79b73c826df85268269bed",
    "index": 4,
    "blockTimestamp": "2023-04-06 18:42:32.043465",
    "proof": 26178,
    "previous_hash": "ea125283f5cb09771214d32fe6e2f7e31b807d48b015ff0df8f2b4e0da287a22",
    "article_title": "BC-BOT Table,1st Ld",
    "article_date": "April 6, 2023 GMT",
    "article_author": "no author",
    "article_link": "https://apnews.com/article/british-columbia-chicago-e0223ceacbc44d21a844e41a1754f916",
    "article_body": "CHICAGO (AP) -- Noon trading on the Chicago Board of Trade Thu.:"
}
{
    "_id": "f8ee5201365e72cb8ae50de03f977a385eb82de14ff9a0fbb188d5c3bfab2e44",
    "index": 5,
    "blockTimestamp": "2023-04-06 18:42:34.137105",
    "proof": 18555,
    "previous_hash": "19d360eaab99b27612916cb0a7229ded19c63f9090e932f611bed120a0c53f02",
    "article_title": "Weather service: 3 tornadoes in Louisville, Kentucky area",
    "article_date": "April 6, 2023 GMT",
    "article_author": "no author",
    "article_link": "https://apnews.com/article/kentucky-tornado-louisville-storm-damage-db19a3320a1674cf4900026c035c51dc",
    "article_body": "LOUISVILLE, Ky. (AP) -- The National Weather Service said Thursday it was surveying damage from three EF-1 tornadoes that touched down in Kentucky.According to preliminary information, tornadoes hit the Pleasure Ridge Park and Newburg sections of Louisville on Wednesday evening, meteorologist Brian Neudorff said. A separate tornado with maximum winds of 110 mph touched down in the Brandonburg area of Mead County, less than an hour southwest of Louisville, Neudorff said.Weather service crews were surveying damage Thursday to determine the path and length of the tornadoes.The storm toppled trees onto houses, ripped down power lines and tore the roof off an apartment building. A tractor-trailer overturned in high winds along Interstate 265 in Louisville. The driver was not injured, Louisville police spokesperson Dwight Mitchell said. About 8,400 customers remained without power late Thursday morning in Jefferson County, which includes Louisville, according to poweroutage.us."
}
{
    "_id": "e5c0eb8e9ac55ade14c3e073b514a50364baa0bcc94d48ad490339ab3ddb98cd",
    "index": 6,
    "blockTimestamp": "2023-04-06 18:42:38.207162",
    "proof": 14414,
    "previous_hash": "0d2c60090a232b97f7c0e2ae40ceb98e50126190e9cfec83b18167904ddb50d0",
    "article_title": "BC-BOT Table,1st Ld",
    "article_date": "April 6, 2023 GMT",
    "article_author": "no author",
    "article_link": "https://apnews.com/article/chicago-british-columbia-92ffe3b9d518400384f8cdd87a187b32",
    "article_body": "CHICAGO (AP) -- Noon trading on the Chicago Board of Trade Thu.:"
}
{
    "_id": "83983983f80b879e3e73d09de10a2531063b79f2bb383c780d6ec8eaca3d5897",
    "index": 7,
    "blockTimestamp": "2023-04-06 18:42:40.596963",
    "proof": 62224,
    "previous_hash": "dc9636f6f864acca53b1a4e1161bf998daa387eb193a336390027cb28c6fc6ed",
    "article_title": "Las 10 canciones mas populares de la semana",
    "article_date": "April 6, 2023 GMT",
    "article_author": "Por The Associated Press",
    "article_link": "https://apnews.com/article/12df7a7e5861e3755ab546c9ad2e21d7",
    "article_body": "Las 10 canciones mas populares de la semana en algunos paises de las Americas y Espana.ARGENTINA1.- \"TQG\" - Karol G, Shakira2.- \"Cupido\" - Tini3.- \"Una noche sin pensar\"- Sebastian Yatra4.- \"Flowers\"- Miley Cyrus5.- \"Shakira: Bzrp Music Sessions, Vol. 53\" - Bizarrap, Shakira6.- \"La formula\" - Maluma, Marc Anthony7.- \"Tu recuerdo\" - Emilia, Lyanno, Wisin8.- \"Bora Bora\" - Abraham Mateo, Luis Fonsi9.- \"Ajedrez\" - David Bisbal10.- \"Ambulancia\" - Camila Cabello, Camilo(Fuente: Los 40 Principales)CHILE1.- \"TQG\" - Karol G, Shakira2.- \"X si volvemos\" - Karol G, Romeo Santos3.- \"Yandel 150\" - Yandel, Feid4.- \"Cupido\" - Tini5.- \"Flowers\"- Miley Cyrus6.- \"Shakira: Bzrp Music Sessions, Vol. 53\" - Bizarrap, Shakira7.- \"Chorrito pa' las animas\" - Feid8.- \"Tormenta\" - Gorillaz, Bad Bunny9.- \"La jumpa\" - Arcangel, Bad Bunny10.- \"Gato de noche\" - Bad Bunny, Nengo Flow(Fuente: Los 40 Principales)COLOMBIA1.- \"TQG\" - Karol G, Shakira2.- \"Yandel 150\" - Yandel, Feid3.- \"Mientras me curo del cora\" - Karol G4.- \"Kill Bill\" - SZA5.- \"Mercho\" - LiL CaKe, Migrantes, Nico Valdi6.- \"La jumpa\" - Arcangel, Bad Bunny8.- \"Flowers\"- Miley Cyrus9.- \"Remix exclusivo\" - Feid10.- \"Punto G\" - Quevedo(Fuente: Los 40 Principales)ESPANA1.- \"TQG\" - Karol G, Shakira2.- \"Flowers\"- Miley Cyrus3.- \"LLYLM\"- Rosalia4.- \"Playa del Ingles\" - Quevedo, Myke Towers5.- \"Kill Bill\" - SZA6.- \"Nochentera\" - Vicco7.- \"Forget Me\" - Lewis Capaldi8.- \"Shakira: Bzrp Music Sessions, Vol. 53\" - Bizarrap, Shakira9.- \"Calm Down\" - Rema, Selena Gomez10.- Put a Light on Me\" - Sam Ryder(Fuente: Los 40 Principales)MEXICO1.- \"Die for You (remix)\" - Ariana Grande, The Weeknd2.- \"Flowers\"- Miley Cyrus3.- \"TQG\" - Karol G, Shakira4.- \"Calm Down\" - Rema, Selena Gomez5.- \"Tormenta\" - Gorillaz, Bad Bunny7.- \"As it was\" - Harry Styles8.- \"Para no verte mas\"- Kenia Os, Thalia9.- \"Ambulancia\" - Camila Cabello, Camilo10.- \"Kill Bill\" - SZA(Fuente: Los 40 Principales)"
}
{
    "_id": "da574a894bc923e14c385c0ede17585ed06fda9748e899509d7f92f4b2672ff0",
    "index": 8,
    "blockTimestamp": "2023-04-06 18:42:42.921872",
    "proof": 154012,
    "previous_hash": "701694339efe3f9462b226357687e00b571a723a818d686f88f48236eb2cf6f4",
    "article_title": "BC-BOT Table,1st Ld",
    "article_date": "April 6, 2023 GMT",
    "article_author": "no author",
    "article_link": "https://apnews.com/article/british-columbia-chicago-3f49f0ecee244273b11dd155bd02cfb6",
    "article_body": "CHICAGO (AP) -- Noon trading on the Chicago Board of Trade Thu.:"
}
{
    "_id": "91ad10061fe14d9d9eaff8b907d99b58866e0ef4d8c2c22173e5dc60d4bcb09f",
    "index": 9,
    "blockTimestamp": "2023-04-06 18:42:45.337183",
    "proof": 53572,
    "previous_hash": "dce8ff69e685831f4c47bde8667e35143d841b79c76931c240ad376701675d0c",
    "article_title": "Alabama lawmakers approve harsher penalties for fentanyl",
    "article_date": "April 6, 2023 GMT",
    "article_author": "By KIM CHANDLER",
    "article_link": "https://apnews.com/article/fentanyl-alabama-legislature-8decc72fe76ede2813f56a160a03c32c",
    "article_body": "MONTGOMERY, Ala. (AP) -- Alabama lawmakers on Thursday approved harsher penalties for trafficking fentanyl -- with punishments of up to life imprisonment -- as lawmakers try to respond to the deadly overdose crisis. The Alabama Senate approved the House-passed bill on a 31-0 vote that came without any debate. The bill now goes to Alabama Gov. Kay Ivey who said she will sign the legislation into law \"in the swiftest order.\" The bill sets mandatory minimum sentences for fentanyl trafficking based upon the weight of the drug including up to life imprisonment for possession of eight grams or more of the deadly substance. \"Combatting this deadly drug will continue to be a top priority for our Alabama Law Enforcement Agency, and I will do everything in my power to stop this drug from being a killer in Alabama,\" Ivey said in a statement. The Republican governor used her State of the State address last month to urge lawmakers to approve the stiffer penalties. Fentanyl is a powerful synthetic opioid drug. It is often mixed into other drugs, including heroin, methamphetamine and counterfeit pain pills so people might not know they are ingesting it. In 2021 synthetic opioids, primarily fentanyl, were responsible for killing more than 70,000 people in the Unites States, according to the Centers for Disease Control and Prevention. Lawmakers in multiple states across the country are looking to increase fentanyl penalties in an effort to combat what's been called the deadliest overdose crisis in U.S. history. The Alabama legislation by Republican Matt Simpson, a former prosecutor, sets mandatory prison sentences and fines for trafficking one gram of fentanyl or more. Simpson said the weights are for \"pure fentanyl\" instead of the combined weight when fentanyl is mixed with another drug. He said the intent is to target sellers instead of people who are buying drugs that might have been mixed with fentanyl. \"One gram seems low... However, one gram can kill up to 500 people. One gram is not for personal use,\" Simpson said. The mandatory penalties are:-- Three years in prison for amounts between one gram and two grams.-- Ten years in prison for amounts between two grams and four grams. -- Twenty-five years in prison for amounts between four grams and eight grams.-- Life imprisonment with the possibility of parole for amounts of eight grams or more. Barry Matson, executive director of the Alabama District Attorneys Association, said while the bill passed with little floor debate, there had been a lot of discussions with lawmakers ahead of the vote. He said several lawmakers wanted assurances that the weights weren't too low. \"A gram of fentanyl will kill a lot of people,\" Matson said. "
}
